#+hugo_categories: Emacs
#+hugo_tags: Doom OrgMode
#+hugo_draft: false
#+hugo_locale: zh
#+hugo_lastmod: 2022-04-30T17:06:59+08:00
#+hugo_auto_set_lastmod: nil
#+hugo_front_matter_key_replace: author>authors
#+hugo_custom_front_matter: :outdatedArticleReminder '((enable . true))
#+title: Doom Emacs 配置文件
# Title: Doom Emacs Configuration
#+subtitle: 疯狂的方法、管理与动物园 --- 细致入微
# Subtitle: The Methods, Management, and Menagerie@@latex:\\@@ of Madness@@latex: --- in meticulous detail@@
#+author: GinShio
#+date: 2022-04-08T22:13:23+08:00
#+email: ginshio78@gmail.com
#+description: GinShio | GinShio's Doom Emacs Configuration
#+keywords: Emacs Doom OrgMode
#+export_file_name: doom_emacs_configuration.zh-cn.txt


#+begin_info
本篇是基于 [[http://tecosaur.com/][tecosaur]] 的 [[https://github.com/tecosaur/emacs-config][Emacs 配置]] 大幅缩减版本，如果你对 Org Mode 感兴趣可以看他
制作的 [[https://blog.tecosaur.com/tmio/][This Month in Org]]。

本篇标题和副标题均采用原标题的中译
 - *Title*: Doom Emacs Configuration
 - *Subtitle*: The Methods, Management, and Menagerie of Madness --- in meticulous detail
#+end_info


#+begin_quote
让我们改变对程序构建的传统态度：
与其想象我们的主要任务是指导计算机做什么，
不如专注于向人们解释我们想让计算机做什么。
@@latex:\mbox{@@--- 高德纳@@latex:}@@
#+end_quote

*** Eros
#+begin_comment
来自 =:tools eval= 模块
#+end_comment

这个包可以修改 emacs lisp 内联执行的视觉效果，让这个结果的前缀更好看一点。
#+begin_src emacs-lisp
(setq eros-eval-result-prefix "⟹ ") ; default =>
#+end_src

你可以用 =C-x C-e= 来对比一下前后变化
#+begin_src emacs-lisp :tangle no :results vaule replace
(+ 1 1 (* 2 2) 1)
#+end_src

#+RESULTS:
: 7

#+begin_src python :tangle no :results vaule replace
return 2 ** 4
#+end_src

#+RESULTS:
: 16

